In [269]:
import pandas as pd
import numpy as np

In [139]:
labels = ['a', 'b', 'c'] #cria uma lista com caracteres

In [140]:
minha_lista = [10, 20, 30] #cria uma lista de inteiros
arr = np.array([10,20,30]) #cria um array usando numpy
d = {'a': 10, 'b': 20, 'c': 30} #cria um dicionario com as labels e o arr

In [141]:
pd.Series(data = minha_lista, index = labels) #cria uma series usando a lista e o a labels

a    10
b    20
c    30
dtype: int64

In [142]:
series = pd.Series(data = minha_lista, index = labels) #define series como a series criada anteriormente

In [143]:
series['b'] #acessa o item b da series

np.int64(20)

In [144]:
pd.Series(arr, labels) #criando outra series agr com o array

a    10
b    20
c    30
dtype: int64

In [145]:
pd.Series([sum, print, len]) #uma serie com as funcaos do python

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [146]:
ser1 = pd.Series([1,2,3,4], ['EUA', 'Alemanha', 'URSS', 'Japao']) #cria uma series usando 1,2,3,4 e os paises

In [147]:
ser1

EUA         1
Alemanha    2
URSS        3
Japao       4
dtype: int64

In [148]:
ser2 = pd.Series([1,2,3,4], ['EUA', 'Alemanha', 'Italia', 'Japao']) #criando uma 2 series e colocandi italia no lugar da URSS

In [149]:
ser2

EUA         1
Alemanha    2
Italia      3
Japao       4
dtype: int64

In [150]:
ser1 + ser2 #somando duas series diferentes

Alemanha    4.0
EUA         2.0
Italia      NaN
Japao       8.0
URSS        NaN
dtype: float64

SEGUNDO VIDEO

In [151]:
np.random.seed(101) #uma seed pra gerar os mesmos numreos aleatorios do video

In [152]:
df = pd.DataFrame(np.random.randn(5,4), 'A B C D E'.split(), 'W X Y Z'.split()) #cria um datagrame de numeros aleatorios

In [153]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [154]:
df['W'] #acessa a coluna W do dataframe

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [155]:
type(df) #pega o tipo de dado do df

pandas.core.frame.DataFrame

In [156]:
df[['W', 'Z']] #pega as colunas W e Z

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [157]:
df.W #outra forma de acessar a coluna

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [158]:
df['new'] = df['W'] + df['X'] #cria uma nova coluna

In [159]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [160]:
df.drop('new', axis = 1, inplace = True) #remove a coluna new

In [161]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [162]:
df.loc[['A', 'B'], ['X', 'Y', 'Z']] #pega os dados das linhas A e B com as colunas X Y Z

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965

In [163]:
df.iloc[1:4, 2:] #pegando dados usando a forma do numpy

          Y         Z
B -0.848077  0.605965
C  0.528813 -0.589001
D -0.933237  0.955057

In [164]:
bol = df > 0 #filtra por valores maiores que 0

In [165]:
df[bol] #passa o filtro no df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [166]:
df[df['W'] > 0] #pega as linhas do dataframe que sao maiores que 0 na coluna W

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [167]:
df[df['W'] > 0]['Y'] #pega os valores de y mas so das linhas onde o valro de W e maior que 0

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [168]:
bol = df['W'] > 0
df2 = df[bol]
df2['Y']  #faz a mesma coisa que o codigo de cima, soq escrito de forma diferente

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [169]:
df[(df['W'] > 0) & (df['Y'] > 1)] #pega as linhas onde W e > 0 e Y e > 1

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [170]:
df.reset_index(inplace = True) #joga pra um indice padrao de 0, 1, 2... e o inplace faz com q ele mude no df original

In [171]:
df

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [172]:
col = 'RS RJ SP AM SC'.split() #definindo nomes das colunas

In [173]:
col

['RS', 'RJ', 'SP', 'AM', 'SC']

In [174]:
df['Estado'] = col #cria uma nova coluna no df

In [175]:
df

  index         W         X         Y         Z Estado
0     A  2.706850  0.628133  0.907969  0.503826     RS
1     B  0.651118 -0.319318 -0.848077  0.605965     RJ
2     C -2.018168  0.740122  0.528813 -0.589001     SP
3     D  0.188695 -0.758872 -0.933237  0.955057     AM
4     E  0.190794  1.978757  2.605967  0.683509     SC

In [176]:
df.set_index('Estado') #joga o Estado como index do df

       index         W         X         Y         Z
Estado
RS         A  2.706850  0.628133  0.907969  0.503826
RJ         B  0.651118 -0.319318 -0.848077  0.605965
SP         C -2.018168  0.740122  0.528813 -0.589001
AM         D  0.188695 -0.758872 -0.933237  0.955057
SC         E  0.190794  1.978757  2.605967  0.683509

TERCEIRO VIDEO

In [177]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2'] #lista com nomes
inside = [1, 2, 3, 1, 2, 3] #lista com numeros
hier_index = list(zip(outside,inside)) #junta as duas listas em uma lista com [g1, 1] e assim vai
hier_index = pd.MultiIndex.from_tuples(hier_index) #o multiindex faz com q o df tera um subindex

In [178]:
outside #printa o outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [179]:
inside #printa o inside

[1, 2, 3, 1, 2, 3]

In [180]:
hier_index = list(zip(outside,inside)) #mesma coisa q la em cima

In [181]:
hier_index #printa o hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [182]:
hier_index = pd.MultiIndex.from_tuples(hier_index) #faz a mesma coisa que la em cima

In [183]:
hier_index #printa o hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [184]:
df = pd.DataFrame(np.random.randn(6, 2), index = hier_index, columns = ['A','B']) #cria um df a partir do hier_index

In [185]:
df #printa o df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [186]:
df.loc['G1'] #pega somente o index g1 do df

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [187]:
df.index.names #pega o nome dos indexs

FrozenList([None, None])

In [188]:
df.index.names = ['Grupo', 'Numero'] #definindo nome pros indices

In [189]:
df.index.names #printa o nome dos indexs

FrozenList(['Grupo', 'Numero'])

In [190]:
df

                     A         B
Grupo Numero
G1    1       0.302665  1.693723
      2      -1.706086 -1.159119
      3      -0.134841  0.390528
G2    1       0.166905  0.184502
      2       0.807706  0.072960
      3       0.638787  0.329646

In [191]:
df.xs(1, level = 'Numero') #pega os valores do indice 1 de G1 e G2

              A         B
Grupo
G1     0.302665  1.693723
G2     0.166905  0.184502

QUARTO VIDEO

In [192]:
d = {
    'A': [1, 2, np.nan],
    'B': [5, np.nan, np.nan],
    'C': [1, 2, 3]
} #cria um dicionario

In [193]:
df = pd.DataFrame(d) #cria um df a partir do dicionario

In [194]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [195]:
df.dropna() #pega somente as linhas que nao tem o NaN

     A    B  C
0  1.0  5.0  1

In [196]:
df.dropna(thresh = 2) #pega a linha que tem 2 ou menos NaN

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [197]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [198]:
df.fillna(value = 'fill na') #onde tem NaN preenche com fill na

         A        B  C
0      1.0      5.0  1
1      2.0  fill na  2
2  fill na  fill na  3

In [199]:
df['A'].fillna(value = df['A'].mean()) #preenche as coluna  A e onde tem NaN preenche com a media dos valores

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [200]:
df.fillna(method = 'ffill') #onde tem o NaN ele copia o ultimo valor lido

/tmp/ipykernel_9167/1145651979.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = 'ffill')

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

QUINTO VIODE

In [201]:
data = {'Empresa':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Nome':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Venda':[200,120,340,124,243,350]} #cria um dicionario

In [202]:
data

{'Empresa': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Nome': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Venda': [200, 120, 340, 124, 243, 350]}

In [203]:
df = pd.DataFrame(data) #faz um df a partir do dicionario

In [204]:
df

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [205]:
group = df.groupby('Empresa') #agrupa por empresa

In [206]:
group.sum() #soma tudo de cada empresa, desde funcionarios ate as vendas

               Nome  Venda
Empresa
FB        CarlSarah    593
GOOG     SamCharlie    320
MSFT     AmyVanessa    464

In [207]:
group.describe() #faz estatisticas de cada empresa

        Venda
        count   mean         std    min     25%    50%     75%    max
Empresa
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [208]:
group = df.groupby('Nome') #agrupa por no,e

In [209]:
group.sum().loc['Amy'] #pega a pessoa de nome Amy

Empresa    MSFT
Venda       340
Name: Amy, dtype: object

SEXTO VIDEO

In [210]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3]) #cria um df

In [211]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [212]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) #cria outro df

In [213]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [214]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11]) #cria outro df

In [215]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [216]:
pd.concat([df1, df2, df3]) #junta os 3 df

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [217]:
pd.concat([df1,df2,df3], axis = 1) #junta a partir do indice, pq isso estao na diagonal

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [218]:
esquerda = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})

direita = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})
#cria dataframes

In [219]:
esquerda

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [220]:
direita

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [221]:
pd.merge(esquerda,direita, how='inner', on='key') #junta a partir da coluna key

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [278]:
esquerda = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})

direita = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [280]:
esquerda

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [281]:
direita

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [223]:
pd.merge(esquerda, direita, on = ['key1', 'key2']) #junta onde as keys forem iguais

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [224]:
pd.merge(esquerda, direita, how = 'outer', on = ['key1', 'key2']) #junta os df e onde nao tiver numero coloca NaN

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K0  NaN  NaN   C3   D3
5   K2   K1   A3   B3  NaN  NaN

In [225]:
pd.merge(esquerda, direita, how = 'right', on = ['key1', 'key2']) #deixa todas as linhas do df direita e junta com os q bater as keys com o da esquerda

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [226]:
pd.merge(esquerda, direita, how = 'left', on = ['key1', 'key2']) #faz o msm com o de cima mas agr mantendo o da esquerda

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [227]:
esquerda = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

direita = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3']) #criando 2 df

In [228]:
esquerda

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [229]:
direita

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [230]:
esquerda.join(direita) #deixa as linhas da esquerda e procura iguais na direita

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [231]:
esquerda.join(direita, how = 'outer') #junta os dois df e onde n ao tiver ciguais ele coloca o NaN

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [232]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']}) #cria um df

In [233]:
df.head() #mostra o topo do df o comeco

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [234]:
df['col2'].unique() #pega os valores da coluna 2

array([444, 555, 666])

In [235]:
np.unique(df['col2']) #uma forma com numpy

array([444, 555, 666])

In [236]:
df['col2'].nunique() #conta qnts valores diferentes tem na coluna

3

In [237]:
df['col2'].value_counts() #quanto de cada valor tem na coluna

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [238]:
df[(df['col1'] > 2) & (df['col2'] == 444)] #pega linha > que 2 na col1 onde a linha da col2 e igual a 444

   col1  col2 col3
3     4   444  xyz

In [239]:
def vezes2(x):
    return x * 2 #cria uma funcao pra multiplicar por 2

In [240]:
df['col1'].sum() #soma os valores da coluna 1

np.int64(10)

In [241]:
df['col1'].apply(vezes2) #aplica a funcao vezes2 nos valores da coluna 1

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [242]:
df['col3'].apply(len) #pega o tamanho de cada valor da coluna 3

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [243]:
df['col1'].apply(lambda x: x * x) #funcao lambda que multiplicada cada numero por si mesmo da coluna 1

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [244]:
del df['col2'] #deleta a coluna 2

In [119]:
df

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [120]:
df.columns #pega as colunas do df

Index(['col1', 'col3'], dtype='object')

In [121]:
df.index #pega os indexs do df

RangeIndex(start=0, stop=4, step=1)

In [123]:
df.sort_values(by = 'col2') #ordena do menor pro maior a coluna 2

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [124]:
df.isnull() #boolean pra ver se ta null ou nao

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [125]:
df.dropna() #dropa os valores NaN

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [126]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']}) #um df

In [127]:
df.head() #pega o inicio do df

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [129]:
df['col1'].fillna(df['col1'].mean()) #preenche os NaN com a media dos valores

0    1.0
1    2.0
2    3.0
3    2.0
Name: col1, dtype: float64

In [130]:
df #printa o df

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [131]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]} #um dicionario

In [132]:
df = pd.DataFrame(data) #df apartir do dicionario

In [133]:
df #printa o df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [135]:
df.pivot_table('D', ['A', 'B'], 'C') #faz uma tabela com os valores de D linha A e B e os valores de C

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [250]:
df = pd.read_csv('exemplo', sep = ',') #le o arquivo exemplo

In [251]:
df #dados do arquivo transformado em df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [252]:
df = df + 1 #soma 1 a todos os valores do df

In [253]:
df

    a   b   c   d
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [254]:
df.to_csv('exemplo.csv', sep = ';', decimal = ',') #exporta um novo arquivo csv

In [262]:
df = pd.read_excel('Exemplo_Excel.xlsx', sheet_name='Sheet1') #le um arquivo excel

In [263]:
df #o arquivo excel em formato de df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [266]:
df.to_excel('exemplo.xlsx', sheet_name='Sheet1') #exporta um novo arquivo pra excol

In [273]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html') #le um site html

In [275]:
type(df) #pega o tipo do df

list

In [276]:
len(df) #pega o tamanho do df

1

In [272]:
df[0] #pega a primeira pagina do site html

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund Sort ascending
0,The Santa Anna National Bank,Santa Anna,Texas,5520,Coleman County State Bank,"June 27, 2025",10549
1,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
2,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,First Bank & Trust Co.,"October 18, 2024",10547
3,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
4,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
5,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
6,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
7,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
8,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
9,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
10,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
11,The First State Bank,Barboursville,West Virginia,14361,"MVB Bank, Inc.","April 3, 2020",10536
12,Ericson State Bank,Ericson,Nebraska,18265,Farmers and Merchants Bank,"February 14, 2020",10535
13,City National Bank of New Jersey,Newark,New Jersey,21111,Industrial Bank,"November 1, 2019",10534
14,Resolute Bank,Maumee,Ohio,58317,Buckeye State Bank,"October 25, 2019",10533
15,Louisa Community Bank,Louisa,Kentucky,58112,Kentucky Farmers Bank Corporation,"October 25, 2019",10532
16,The Enloe State Bank,Cooper,Texas,10716,"Legend Bank, N. A.","May 31, 2019",10531
17,Washington Federal Bank for Savings,Chicago,Illinois,30570,Royal Savings Bank,"December 15, 2017",10530
18,The Farmers and Merchants State Bank of Argonia,Argonia,Kansas,17719,Conway Bank,"October 13, 2017",10529
19,Fayette County Bank,Saint Elmo,Illinois,1802,"United Fidelity Bank, fsb","May 26, 2017",10528
20,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,Wisconsin,30003,First-Citizens Bank & Trust Company,"May 5, 2017",10527
21,First NBC Bank,New Orleans,Louisiana,58302,Whitney Bank,"April 28, 2017",10526
22,Proficio Bank,Cottonwood Heights,Utah,35495,Cache Valley Bank,"March 3, 2017",10525
23,Seaway Bank and Trust Company,Chicago,Illinois,19328,State Bank of Texas,"January 27, 2017",10524
24,Harvest Community Bank,Pennsville,New Jersey,34951,First-Citizens Bank & Trust Company,"January 13, 2017",10523

In [277]:
df[0]['Bank Name'] #filtra somente o nome dos bancos da primeira pagina

0                          The Santa Anna National Bank
1                                  Pulaski Savings Bank
2                    The First National Bank of Lindsay
3                 Republic First Bank dba Republic Bank
4                                         Citizens Bank
5                              Heartland Tri-State Bank
6                                   First Republic Bank
7                                        Signature Bank
8                                   Silicon Valley Bank
9                                     Almena State Bank
10                           First City Bank of Florida
11                                 The First State Bank
12                                   Ericson State Bank
13                     City National Bank of New Jersey
14                                        Resolute Bank
15                                Louisa Community Bank
16                                 The Enloe State Bank
17                  Washington Federal Bank for Savings
18      The Farmers and Merchants State Bank of Argonia
19                                  Fayette County Bank
20    Guaranty Bank, (d/b/a BestBank in Georgia & Mi...
21                                       First NBC Bank
22                                        Proficio Bank
23                        Seaway Bank and Trust Company
24                               Harvest Community Bank
Name: Bank Name, dtype: object